# IsCurveLoopsInsideHostBoundaries Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaLoad..::..IsCurveLoopsInsideHostBoundaries Method
AreaLoad Class See Also
---
Checks if contour loops is inside host boundaries.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static bool IsCurveLoopsInsideHostBoundaries(
	Document doc,
	ElementId hostId,
	IList<CurveLoop> loops
)
```

Visual Basic
---
```text
Public Shared Function IsCurveLoopsInsideHostBoundaries ( _
	doc As Document, _
	hostId As ElementId, _
	loops As IList(Of CurveLoop) _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsCurveLoopsInsideHostBoundaries(
	Document^ doc,
	ElementId^ hostId,
	IList<CurveLoop^>^ loops
)
```

# ### Parameters
doc
    Type: Autodesk.Revit.DB..::..Document Document.
hostId
    Type: Autodesk.Revit.DB..::..ElementId The id of the analytical element that is about to host a load
loops
    Type: System.Collections.Generic..::..IList<(Of <(<'CurveLoop>)>)> CurveLoops to be checked.
# ### Return Value
Returns true if area load is positioned with entire distribution over the host, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace